["Can i buy SHIB ??", "Ah I see at least it stakes again for shib token", "if anyone has the issue I was having, not being able to purchase SHIB, add a period after the amount you're attempting to buy. for me, buying 1 million, needed to be like this 1,000,000. <--------- note the period", "I have £869 value of shib, I put that value in earn saying I am depositing £800", "Also why does it show less value of shib i want to put in crypto earn then i actually i have", "hope I can get some help here. attempting to buy 1 million SHIB with MasterCard I've already added. when entering the amount, nothing happens", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "Hey Admin I just bought some shibs. I notice Crypto com charges at 0.0003. I'm checking the Grap shibs did not go above 0.0002065", "Yes bos shib ke barhne ke bahut jyada chance hai \n2021 me aprox 1 inr ho skta hai", "Is there any future for shib", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "Who is the owner of doge and shib coins", "What is the other new shitcoin next to doge and shib", "Buy cro put it in supercharger and farm shib", "Hello guys; is it good/beneficial to enter the Super Charger for Shib? I bought millions of the Shiba. I found this option under the Super Charger option.\nI'm new to this sorry for my ignorance, I'm still failing to grasp this option, can some please help me understand this in layman's terms?", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "I have 4m shib on crypto.com", "How do I get in on the shib", "Need to put in CRO and in 45 days you get some SHIB", "There is a supercharger event for SHIB", "What about the SHIB movement?\n It has gone down majorly", "We’ve just recently supported it! Check out the announcement post here and be sure to follow to never miss an update! 😊", "Crypto.com app is allowing SHIB deposits now ?", "Why cant I convert my SHIB to ETH on your app?", "I'm just waiting for the Indian covid relief fund to dump their one billion dollars worth of SHIB. Any time now...", "What about SHIB?", "I tried to purchase $18.44 of shib", "Can I now ask about the $15 of shib that I never got?", "I have eth but don’t know steps to get shib.", "How can I buy shib on crypto.com \nDo I sale my eth to another in crypto wallet that I can buy shib with", "SHIB Supercharger event is now live 🔥\n\n⚡Deposit CRO and farm SHIB with 1-click🖱️\n⚡No gas fees, withdraw anytime\n⚡Available on App & Exchange \n\nSign up 👉 bit.ly/2QcxaRi", "One question about supercharger ! While Enjin pool is finished, why is not possible to use proper cro to participate in shib pool?", "SHIB Supercharger event is now live 🔥\n\n⚡Deposit CRO and farm SHIB with 1-click🖱️\n⚡No gas fees, withdraw anytime\n⚡Available on App & Exchange \n\nSign up 👉 bit.ly/2QcxaRi", "Please first vitalik dumps $SHIB on me (down 60%) then i buy $btc immidietly and elon dumps it on me atleast -10% now binance dumps on me! That settles it im done!!!!! Its over!😔😔😔😔", "ADA is just as shitty as SHIB", "Ada is actually doing something vrs what shib is. Doge and shib are a fad right now because of Elon shitface", "Works for me Joe with Doge and Shib so far", "Vb dumped all his shib to India", "Can I use my cro used for previous supercharger for SHIB event or I must leave CRO until acceptance of Eijin reward?", "For the love of God please do not supercharge shib.", "Please do not supercharger shib", "The ENJ Supercharger event has ended!\nNext Up: SHIB\n\nTo accept your ENJ reward allocation, login at 14:00 UTC, 14 May. \nReward distribution begins at 14:00 UTC, 15 May.\n\nDetails: https://crypto.com/exchange/supercharger/enj-7", "Lol at buying SHIB", "I was credited the coins I got Saturday when app was down I bought almost 9 million shib at 100 dollars and they credited the money gain as well so they credited almost 300 dollars", "Doge and now SHIB. I wonder if this is the end of the shitcoin trend actually ... many people have lost an awful lot of money", "oh, so now when the ENJ charging period ends my CRO are automatically transferred to the SHIB supercharger?", "How to buy shib..I m using wazirx", "I buy shib yesterday 😂😂😂", "Shib", "Shib is another elon musk coin", "I transfered 2.500.000 shib to another wallet. Crypto.com charged me with 1.000.000 shib. Why this high fee? Its normal?", "Try this\n\nCrypto App > Transfer > Withdraw > External wallet > add address > (+) sign on the top right corner > SHIB", "SHIB withdrawals are enabled already — Transfers may take up to 2hrs", "The supercharger with SHIB was a real dissappointment. SHIB is another useless nonsense meme coin and worse it's an ERC20. \n\nI would much prefer to see coins on supercharger with real potential and utility. ENJ was alright. But what about coin launches on supercharger or having more than one coin at a time???", "Did Crypto.com bought shib from Vitalik?", "Is there a reason why my SHIB withdrawal has been pending for 2 hours now? Yesterday it took less than 10 min", "Guys What about shib", "I guess.  By that time I will have already missed the shib boat", "how's about SHIB??\ncan anyone tell me?", "Vitalik is the CEO of ETH, and he is friends with the owner of shib", "SHIB hasn’t either, though — The holder did", "Nonsense vitalik is making a killing off shib, he is still holding. Cant keep a good dog down", "Hi. How its posible to charge me with 1000000 shib from 2500000 shib ? I transfered from crypto to gate.io", "Hi. How its posible to charge me with 1000000 shib from 2500000 shib ? I transfered from crypto to gate.io", "Next on Supercharger - SHIB ⚡\n\n💰 Deposit CRO & farm SHIB with 1-click\n🔥 USD 2M allocation\n🗓 13 May 2021, 17:00 UTC\n\nSign Up Now: bit.ly/2QcxaRi\n\nDetails: https://blog.crypto.com/supercharger-to-feature-shiba-token-shib/", "In 23 hours actually\n\nhttps://crypto.com/exchange/supercharger/shib-8", "I bought $200~ shib on Sunday. You pulled $800~. Only $500~ was ever shown on the app and that way delayed by a day and half.", "Hey @admins I'd like to speak to you. I am Shytoshi Kusama Product Manager of Shib", "I got hit with 1mil shib fee", "Ok question if I buy 600 quids worth of shib shit coin ile get loads , if I put 600quid in the supercharger ile get pretty much fuck all shib shit coin .it that correct", "What do you think about shib?", "Hello.\n\nI cant input more than 999,999 when I go to sell my Shib coins.\n\nHow do I sell millions in one go?\n\nThanks", "Hello.\n\nI cant input more than 999,999 when I go to sell my Shib coins.\n\nHow do I sell millions in one go?\n\nThanks", "Just bought Shib.....will sleep and see next year. Pray hard....it will be like ETH.....😂😂😂", "is it still worth buying shib?", "What happened to $SHIB", "Shib will pump or not?", "Shib is worth? Or I should buy?", "Guys shib is worth?", "Hmm shib is down 14% but it's on supercharger", "Just bought  soms shib", "Next on Supercharger - SHIB ⚡\n\n💰 Deposit CRO & farm SHIB with 1-click\n🔥 USD 2M allocation\n🗓 13 May 2021, 17:00 UTC\n\nSign Up Now: bit.ly/2QcxaRi\n\nDetails: https://blog.crypto.com/supercharger-to-feature-shiba-token-shib/", "Next on Supercharger - SHIB ⚡\n\n💰 Deposit CRO & farm SHIB with 1-click\n🔥 USD 2M allocation\n🗓 13 May 2021, 17:00 UTC\n\nSign Up Now: bit.ly/2QcxaRi\n\nDetails: https://blog.crypto.com/supercharger-to-feature-shiba-token-shib/", "Credit should work or swap fiat to usdt then to shib", "Hello cdc team, why can i only transfer 1 million shib to exchange?", "Can I use my CRO to buy SHIB?", "I tried to buy shiba with debit card and it took my money and never received my shib anyone else have this issue?", "SHIB is going to be hot😍😍😍", "SHIB 🚀🚀🚀", "Who trade SHIB", "Check it out its called Shib btw", "Brian probably another crash dumb because shib was up all day and rn it’s down 17 percent", "I was credited the coins I got Saturday when app was down I bought almost 9 million shib at 100 dollars and they credited the money gain as well so they credited almost 300 dollars", "Anyone know when we can transfer more than 1 Mil of shib from app to exchange?", "Shib!!!", "Are you voting for SHIB in Crypto Earn?", "$shib thoughts?", "yes, it's actually 11% on SHIB", "When they going to allow shib onto the wallet?", "Any shib OG admins here? Just checking", "Does crypto.com sell $SHIB?", "Shib", "SHIB", "SHIB??? 🤔🤔🤔", "Compren shib", "@admin when can we put SHIB in crypto earn", "Received my SHIB coins, thanks 🙏🏻", "Is it happen with anyone who try to purchase shib and dogecoin in last two days ? And order gets rejected and it’s shows today order confirm and whatever you tried to buy added to your account", "Hi can check what happen , to SHIB on Crypto.com, selling is suspend ..", "Anyone got SHIB and what are your thoughts for the future of doge", "Shib purchase completed... thank you CDC team... carry on!\n\nExcellent customer service... we should not be so naive as to expect perfection, rather how you respond to adversity is a more true measure... kudos.", "$SHIB ITALIAN COMMUNITY:\nhttps://t.me/SHIBitalia", "I recieved the SHIB coins now!!", "Why is everyone buying shib? What’s the project?", "I purchased Shib yesterday morning. Funds are gone from my bank but no transaction showing up and I received no coins. Sent emails, no response.", "Hi. Already received 2 of the 3 buys of shib I made saturday, when can I expect the other?", "Do we have any ETA on SHIB withdrawals", "is it shib", "Shib withdrawals are working again, should be fine from your end anytime now", "Another 24 hour wait on coins? It’s already been 3 days for me and I’m still missing 75 million shib", "Admin, my SHIB withdrawal is still pending after after 24 hours. What’s happening?", "Made 3 buys of shib on Saturday. All of them went wrong. Today I received one of them. When can I expect the others 2?", "Hi Mat,\n\nI purchased £51 worth of SHIB on Saturday and you guys didn’t give me my crypto? I have messaged support through the APP however no reply? Can I get some kind of confirmation I will be refunded as it is not showing in my transaction history but you have take it out of my bank,\n\nThanks", "Ight guys just confirming received 1 of 2 purchases I made… shib is real", "Still haven’t received my SHIB purchase from last Saturday", "My friend has been given 5,000000 shib free", "Looks like they stopped buys for SHIB at the moment", "I buy Shib for my cousin. what is the issue you guys are having with depositing money in the wallet? I have deposited 2 time 200 € but it is still not showing up. PLEASE LET ME KNOW WHAT THE PROBLEM IS", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything\nCAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "I bought SHIB on crypto, and they took my money out but never give it to me", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "CAN ANY ADMIN ANSWER what coin to use to biuy SHIB  BTC and CRO you cannot  which is ridiculous you cannot use house coin to buy anything", "ADMIN CHRIS  you cannot buy with BTC or CRO   now what coins can you buy SHIB wiht", "I make 8 transactions of shib\nAll of them were withdrawal and I just received 6 on my account cro\nPlease help me", "You are talking about SHIB, right ? Same situation", "Hi Brian, you should be able to buy SHIB using the following tokens: CRO/BTC/USDC/USDT/TGBP", "ADMIN  what coins can SHIB be bought wiht", "what coins can SHIB be bought wiht", "what coins can SHIB  be bought wiht", "Guys quick question , I believe if you are holder shib token , you Rae normally rewarded for holding shib , is there an plan to reward shib holders on cdc platform , this question is for admis / ambassadors", "We cannot buy SHIB from crypto wallet anymore? Why?", "Guys quick question , I believe if you are holder shib token , you Rae normally rewarded for holding shib , is there an plan to reward shib holders on cdc platform , this question is for admis / ambassadors", "Guys quick question , I believe if you are holder shib token , you Rae normally rewarded for holding shib , is there an plan to reward shib holders on cdc platform , this question is for admis / ambassadors", "Crypto.com , unable to purchase shib coin", "Guys one thing. I had issue when buying shib and ETC on Saturday my bank got debited but no balance is cdc wallet.  Got a credit today in my wallet. So they are working. But maybe you may loose chance to trade out if price goes down. Just like now they have me ETC but it's already fucking down.", "how to move my shib to binance without fees ?", "Are SHIB purchases using CRO disabled?", "Sorry but you have to read the markets and do your own research for that. Investing in projects such as SHIB is quite risky.\n\nNFA", "Can anyone suggest me on Shib?", "Snaps u have been warned…. Yet that dude yelling about shib to the moon still here", "I respect my friends too much to encourage them to lose their money ...rip shib", "So after 3 days my SHIB arrived, Same amount and Same price like i bought them on Saturday. So its fine for me 🤘🏻", "Hey why does shib does not transfer to defi wallet", "I sold some shib dk where the funds would go", "It was 1000usd  in shib and 30.00 usd in eth", "With shib being added will crypto.com list safermoon?", "Never selling my shib! Hodl", "I have been waiting for almost 4 days . $817.00 eth $214.00 shib...... and people just say be patient", "Haha I meant get you some shib!", "I have now been waiting 4 DAYS for my ETH and Shib over $1,100.00 and all I hear is be patient , or wait 48 house !!!!! It’s been 4 days and nothing !!! I’m so trash with this trash ass site ‘", "1.3 million shib I’m hodl!", "Why shib not growing fast", "I have 999,999 x4 of shib that I'm waiting for.... at under .20.....", "ETA on SHIB withdrawals?", "Yeah I’m still missing 100 million shib, hopefully that clears it up cause I’m tired of waiting...", "Woooo 2 1/2 days later and I got 25 million of my 125 million shib... 😱", "Anyone in here holding shib?", "Yeah it is. Tbh i only wanted to spend a certain amount and one my transactions went through so i thought what the hell is going on here. I converted my shib to cro as it is more stable before the pomping. But it's all good there will always be more opportunities kinda annoying though. I'm sure it will get fixed eventually.", "Hello. I purchased SHIB and saw 3 charges as opposed to 2. I got my crypto for 2 chargers. The 3rd didn’t give me crypto but it charged my card still", "Who ever can't buy shib, get at me, I have lots and can sell some to you as I can only sell 10mil of mine apparently...", "39% are you running out of SHIB supply ?", "I tried to buy shiba with debit card and it took my money and never received my shib anyone else have this issue?", "1,  try to transfer shiba from crypto.com to binance ofter 5 hours pending they cancelled it when I transfer it 148% up and when it cancelled transfer it was 89% I lost alot and also the charge me 1000000 shib as transection fee , i don't no where to complain and who gonna take the responsibility of my lost \n2, when I sell they charge me again 3600 worht and I received only 3045 \nMake me upset alout", "It took mine about 36ish hours to show .. it’s the overwhelming buyers for SHIB causing this shit... I don’t think any exchange would be capable of dealing with that amount of transactions all at one go... CHILL OUT PEOPLE YOUR MONEY IS SAFE WITH CDC... if CDC were to run with our money I don’t think they would have all the affiliations they have right now", "i bought 1b shib", "I haven't got the answer yet. Why is it not possible to buy million tokens of SHIB in app? I don't want to do multiple transactions", "How come I have over 100mil shib but can only sell 10mil? How does that work?", "Is there a max cap on amount of shib tokens to be bought? It seems I can't buy in millions in app", "Exactly same here why this is happening !\n\nThey’re taken my money but my shib isn’t there", "I am missing 225 million shib from Saturday and am not getting any answers, could I get some help please?", "I have purchased shib now twice but only one of my purchase is in my wallet \nI need your help please what’s happening to my coins now ???? Only half of them are in my wallet", "SHIB 🚀😇", "Fakir olmak isteyen SHIB coin almasin(ytd).", "I’m so happy SHIB has a wallet now! THANK YOU CRYPTO.COM!", "Shib is listed on binance", "Is there a delay in bnb withdrawal do you know or any other coins apart from just SHIB?", "I bought 10M $SHIB yesterday and they appeared on my wallet like 1-2 minutes after the purchase...", "I have 1 million shib appear in the middle of the night", "I hope a refund is how they resolve this. I no longer want the coins im waiting for. Or they should at least pay out for the same rate the other coins were sold for. I made 2 transactions for shib. Only got 1 lot. Which I no longer own as sold before dip", "Why Crypto.com doesn't allow SHIB withdraws?????????????????", "We gotta pump shib", "Still can’t buy shib with btc after 9 hour of trying to buy. Worthless app", "I am In SHIB I like it", "Is buy shib worthy now??", "It's not saying withdrawals not possible for SHIB :/ no idea what's happening", "Can anyone explain why my SHIB withdrawal is still pending after 8 hours", "anyone buying shib?", "Still can’t buy shib with my btc. Been trying since the last 7-8 hours", "I bought SHIB twice on Saturday between 4-5pm UK time and received the SHIB within a few minutes. This was probably before it got really backed up though.", "Has anyone been able to withdraw SHIB from the app to an external wallet? Before min withdrawal amount was 1.5 million. So I bought more and now it's saying withdrawing is not available for SHIB when earlier it told me it's possible! Anyone managed to withdraw?", "There are two problems here. 1. They took your money and they take time in giving you the coin, for example shib. That is okay. I had that problem I wait 30 min and I got shib. 2. Problem. They took your money they say that there was an error and they don't give you the coin. I had this problem to and it is much more worrisome. Anyone has that particular problem? There is a message saying that the purchase was declined by the issuer but it is false, the money went through.", "Fakir olmak isteyen SHIB coin almasin(ytd).", "Are people selling their CRO for SHIB??", "My mom and dad both did a transaction. And bought shib...it was instant! And in their wallets...I don’t understand why Some people are receiving and others are not 😫", "Yes, I bought for 10 € of shib for 700,000 shib but it took me from my wife's account without giving me the crytpo and these not marked in the history", "Guys \nHow is SHIB in coin ?\nAny suggestions please", "Shib ?", "SHIB?", "Shib to Earn 💎🐳", "who can withdraw shib?", "why are you buying SHIB in the first place! it has 0 value", "I bought Shib and it was taken from my bank, but I never got an email of confirmation and it’s not in my transaction history. And no coins are in the wallet???", "Ive got a failed shib transaction, but im missing 1M shib now, do i need to make a ticket (dont want to add another ticket...) or will it be fixed automatically?", "Yes sent message there also sent email, just open my app 20 minutes before and i got my shib", "Is anyone else experiencing an issue with selling Shib the maximum allowed per sale is 1million ??? I think the app won't allow you input more then 1mill ??", "hey quick question. Yesterday I was tried to buy SHIB. My transaction got failed on the app but I was charged for the coins. Has anyone faced this issue?", "Go ask in shib telegram group", "What do u think about SHIB?", "Hello\nI just bought 1,000,000.00 shib  worth about 30$\nThe money has been blocked from my mastercard but in the app in stead of showing succesful transaction, it showed error please try again.\nWill I receive the shib?\n\nI bought 1 million shib becauae the app told me I reached the limit. I wanted to buy shib in amount of 50$ but the app didn't allowed me.", "I afraid I will loose my all shib 🙁", "Shib!!!", "DEFi SHIB soon", "Here is my gut feeling for transactions made on Saturday and not showing up \n1. The app was already in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but they could not complete the transactions \n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits ? All are lost for us !", "Why do you think shib is a scam coin?", "hi, can I withdraw to external wallet my shib?", "How can I sell my SHIB into Fiat currency inside the crypto.com app?", "Any advice on $shib ?", "Problem is I made a $3000 shib purchase and they charged my bank and now $3000 is on hold but no shib coins and transaction are missing after timeout error\n\nIf transaction log appeared or the charge was drop that’s be fine", "Me too  B with B Shib on Saturday what did you buy?", "Another purchase taken from bank but no coins given.. announcement page says this delay problem has been resolved.. obviously not.. Still owed 1 million shib from Saturday", "Does shib ever plan on leaving eth?", "Withdrew my shib coin but still pending for 2 hrs now", "i am using crypto.com/exchange website, shib withdrawal is disabled", "is SHIB withdrawal disabled?", "Shib", "Here is my gut feeling for transactions made on Saturday and not showing up \n1. The app was already in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but they could not complete the transactions \n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits ? All are lost for us !", "I hope I am wrong but here is my theory on SHIB transactions made on Saturday and not showing up \n1. The app was in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but not used\n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits ? All are lost for us !", "Don’t worry guys we will get out shibs when party is over and crypto can buy it at lower price", "Is anyone else’s SHIB withdrawals taking ages? I’ve been waiting over an hour and a half. Admin, do you know what’s happening?", "38hrs still nothing no shibs. They said 48hr so still waiting", "Hi. Just brought 3mil SHIB and got the Timeout error. But my bank account it shows me the transaction and I’ve been charger for that. So what happens next because theres no customer service", "What is resolved? Still no trace of my SHIB purchased on Saturday!", "Hello I bought shib 1 hour ago and it doesn't appear in my wallet but the money has been taken from my account. and i can not contact the support on the app", "Hello I bought shib on Saturday snd today and up till now it doesn't appear in my wallet but the money has been taken from my account. Please help", "Hello I bought shib since Saturday and up till now it doesn't appear in my wallet but the money has been taken from my account. Please help its been 48 hours already", "Shib on binance to the moon", "How can someone buy SHIB on Binance app", "Y’all that are talking nonsense need to stop talking and read. They are working on it. I had same issues and my account for half has already been corrected and I have not lost a dollar only gained once it corrected. Only lost the chance to watch it go up and up. Shiba (SHIB)", "Shib 🆙. Should I buy now or wait?", "Other than shib what coin is good for investment ??", "Careful with shib many bag holders tryna dump", "Its gone bro. Thanks for the $5 in shib you own", "Anyway Admin please put out a notice on twitter when the app works again.. I just wanted to buy more $SHIB or maybe you finished the ones you have in stock.. then go buy SHIB and add more to the warehouse 😂", "I finally managed to buy SHIB", "I mean why list $SHIB if you don't have the network capacity .. Anyway it crashed lots of exchanges", "Looks like $SHIB crashed the CRO APP", "$SHIB crashed the App", "Damn if this app was working I would of make a lot of money on shib right now. Omfg", "I finally managed to buy a ****coin before moon. 82 million shib lol", "I want my SHIB WHERES MY SHIB!!!!", "Just made 4000$ from Shib 😍😍", "I want my shib!", "List Shib 🚀🚀🚀🚀🚀", "Here is my gut feeling for SHIB transactions made on Saturday \n1. The app was in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but not used\n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits ? All are lost for us !", "Here is my gut feeling for SHIB transactions made on Saturday \n1. The app was in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but not used\n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits ? Well all lost for us !", "Hey! I made 3 transactions on Saturday, 8th May, buying SHIB. Everytime I entered the confirmation code, i receveid a message saying that there was an error.\n\nI didn't receive on my wallet the shib coins that I bought, but today I saw that the money was withdrawn from my bank account.\n\nThis is absurd! You took my money and I didn't recevei the coins.", "Hello I bought shib since Saturday and up till now it doesn't appear in my wallet but the money has been taken from my account. Please help its been 48 hours already", "Still can’t believe that I can’t log in and missing opportunity of buying shib", "Bought 3 bags of shib today and they have all arrived. Thanks CDC!. Get your bags today folks and lets have some fun🤣", "Shib mooning and I’m unable to sign in and buy. Can’t believe it", "SHIB  !!!!   my money grows faster than my weed😂", "What a shame... I could not trade SHIB for 1:30 hours....", "SHIB  !!!!   my money grows faster than my weed😁😁😂😂😂", "SHIB INU // what is going on", "SHIB  !!!!   my money grows faster than my weed", "Shib mooning and I still can’t buy", "just sold my shib for lie 250% profit. cant believe you guys listed SHIB and not some other promising projects", "Anyone have info on why Crypto.com would list a poop coin like SHIB? am I missing something?", "Hello! why did crypto . com list SHIB?", "I \nSold shib. I c it in transaction history. But it is still in my portfolio. And if i try to sell again it says no Bala nce..", "Dear admin, just converted CRO to SHIB this morning and still pending. please help", "Why I can move to Exhange only 1 million of SHIB?", "Hiw to buy shib..?", "Made some much Money Already with shib coin", "How to buy shib", "I am not even sure I will get the SHIB coins I purchased on Saturday at less than half current price !", "I Sold shib. I c it in transaction history. But it is still in my portfolio. And if i try to sell again it says no Bala nce..", "All market became shib and doge🙄", "Why selling shib is not reflected in app", "Your admin flagged me for mentioning shib a week ago and here we are listing shib. 😹", "Shib has dropped 💀💀", "shib👍", "Shib great listing!", "I purchased SHIB this morning but it seems that it is still pending, and the balance in the app is not updated.  when will this be fixed?", "Hello I bought shib since Saturday and up till now it doesn't appear in my wallet but the money has been taken from my account. Please help its been 48 hours already", "It's unacceptable that I cannot own the SHIB I payed for... Are you kidding me Crypto.com?", "I can't transfer SHIB from app to exchange,  it says that is not suported but i see the coin on exchange, WHY ????", "I sold my shib coins like an hour ago I can not see the USDT I sold it to on the app Buh I got the email that is sent", "How can i Buy Shib?", "Could be they didn't even have enough shib to sell", "Here is my gut feeling for SHIB transactions made on Saturday \n1. The app was in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken (cards, bank accounts) but not used\n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits are lost for us !", "When my money will be showing in the app!!! I sold my SHIB to USDC before the price dropping!!", "Good morning, \nAdmin, this morning I bought the Shib tokens but I don't see them in the wallet count ...", "Can’t convert usdt to shib on binanacr yet", "Shib to the moon\nListed on binance", "1. The app was in a mess on Saturday \n2. They got too many SHIB orders and most of them were not executed \n3. Money was taken but not executed\n4. Expect to receive a refund of your bank or card withdrawal\n5. Profits are lost for us !", "A lot of the SHIB transactions did not go through actually, they were never done in my opinion", "Those getting there SHIB with a delay have a trace (either email or transaction history)", "Hey, I bought 39M SHIB but the crypto is not in my wallet did you have this problem ?", "Shib is mooning :( and I can t even buy.", "Shib keeps on going up", "Got into SHIB but dont see them listed in my wallet... Why?", "i need help from admins.. i boght SHIB and i can't see it in my wallet ...", "I Sold shib. I c it in transaction history. But it is still in my portfolio. And if i try to sell again it says no Bala nce..", "I \nSold shib. I c it in transaction history. But it is still in my portfolio. And if i try to sell again it says no Bala nce..", "Crypto.com Exchange lists SHIB.\nTrade SHIB in USDT pair now. \n\nSign up 👉 bit.ly/381R0F2", "Shib?", "Anyone fail to sell SHIB to USDC? I got the confirmation email, but nothing happened in the app", "Hey cdc support, I tried to sell my SHIB to USDC and I got the confirmation email. Why my crypto wallet still showing SHIB and no USDC?", "ima be pissed off if i cant buy shib and it sky rockets", "Hey cdc support, I tried to sell my SHIB to USDC and I got the confirmation email. Why my crypto wallet still showing SHIB and no USDC?", "damn, just wannted to buy some shib lol", "shib is causing problems😅", "I sold shib. I c it in transaction history. But it is still in my portfolio. And if i try to dell again it says no Bala nce..", "Presenting later this year.\nPreparing an NFT project from SHIB. SHIBA will continue to help Shiba Inu dogs through Amazon Smile, with your Amazon purchases going to the Shiba Inu Rescue Association. So we buy all the shiba !!!", "I sold shib. I c it in transaction history. But it is still in my portfolio. And if i try to dell again it says no Bala nce..", "Transferred some xrp to shib and to cro this morning and its not showing in my  crypto wallet ?", "I sold shib. I c it in transaction history. But it is still in my portfolio. And if i try to dell again it says no Bala nce.. i want to sell snd i cannot", "I bought SHIB on Saturday and I got nothing, no confirmation, no transaction info in my history, nothing whatsoever", "So whats the issue with Shib?", "I dold shib. I c it in transaction history. But it is still in my portfolio. And if i try to dell again it says no Bala nce..", "Why can I not sell my shib, what is the point in trading with this company if you are not going to let people realise profit completely unacceptable and shady", "It happened to me on Saturday, SHIB coins do not appear yet !", "Is anybody else having a problem with SHIB ?", "But money is gone and there is no SHIB in my Wallet", "Why can’t I sell my shib this is completely unacceptable", "When i was trying to buy SHIB in payment process my debit cart diclined", "Absolute con that I can’t sell my shib", "Why can’t I sell my shib?", "Why can’t I sell my shib on the app", "What’s going on with SHIB? Just bought 415k but they wont show up", "From where to buy SHIB?", "how long did it take for you guys to get SHIB in your wallet after a succesful transaction?", "Has anyone here made a purchase of SHIB on Saturday and got his/her coins ?", "Has anyone here made a purchase of SHIB on Saturday and got his/her coins ?", "Hey admin can you add shib on cro app?", "Attention SHIB community, deposits and withdrawals of SHIB are now enabled on the Crypto.com App. \n\nDeposit now 👉 crypto.onelink.me/J9Lg/6c2d574e", "https://twitter.com/cryptocom/status/1391686952362004484?s=19", "SHIB Yargı dağıtıyor%80 artış oldu Elon musk sağolsun😍😂", "I feel that the best they will do is to refund our bank transfers because the SHIB transactions did not go through on Saturday, they were overwhelmed. Result : lost 100 % of my 120 % profit !", "I bought SHIB half price two days ago !! But they do not show up, even not sure the transactions went though , shame really !", "shib is going crazy and in 2h it will be on binance🤯", "My feeling is that they have not managed to buy the SHIB on our behalves and the best we can get is a refund, in the meantime SHIB has gone up two fold !", "I purchased some $Shib Saturday and the purchases timed out. My bank was still charged but my account in the app does not display this transaction.  Is this typical with the normal delays or is it different", "Slight ??!!? I purchased SHIB on Saturday and still not appearing!!", "A little ? more time ? I bought SHIB on Saturday, still not appearing !", "I purchased SHIB with the app on Saturday (!!) still no trace of them !", "Shib", "Can you please let me know how long it will take to show in account I bought Shib coin ??", "I transferred Eth to cro to buy shib but still nothing", "I bought shib not showing in my account", "Wondering why selling SHIB has a much lower USDC to crypto wallet (around 8%) than the USD shown...?", "Hi I need help with my account I’ve deposited money into shib it’s took it out of my bank account and not give me the coins", "I have bought SHIB and it’s not showing in my account \nMoney has been taken from my bank\nPlease help me", "I’m missing $1,031.00 atm from eth and shib", "Did SHIB just get added to crypto.com?", "Same thing happened with me and SHIB", "Guys what's wrong with the assets ? \n\nI bought some shib and I haven't received my assets yet ?? \n\n@admin ??", "Just got some SHIB and while you took the money, the coins do not show in my balance.", "@WisteriaCDC avg wait time for SHIB coins to appear after purchase?", "I bought Shib but the balance doesn’t show in my wallet 🤣", "It's an empty string followed by SHIB... It doesn't say the minimum amount🥲", "Shib is available on which platform?", "I had same problem yesterday with buying shib. 1 transaction went through, other money went but still awaiting the coins", "The App issues were caused by the listing of SHIB and the overwhelming reaction of the users. The team is working on fully restoring the operational performance of the App and the transactions.\n\nPlease be patient, and sorry for the inconvenience 🙏", "I have bought SHIB yesterday and it’s still not available or credited \nBut money has been taken from my bank \nPlease..I need an answer \nAsking for help from yesterday onwards", "I got the same thing. Two transactions are frozen right now in my bank. I did receive shib for one of the transactions.", "Crypto man!! Bought that damn SHIB.. and CRO.. it transacted with my bank and said price timed out and poof.. no funds", "Anyone know why I’m getting any error trying to buy shib?", "Can i buy shib whit exchange?", "Is SHIB Has good future? Your views huys", "Just noticed SHIB available in Crypto.com", "SHIB is win!", "Hello...\n\nThis is ritej gaba. Yesterday 8th may night i bought SHIB worth 401.27$\n\nI made purchase through my Debit Card where money from my bank account is deducted but on crypto app it showed an error and purchase is not showing up.\n\nI tried contacting on app but no response please see into this matter ASAP.", "Do you think Shib comes to Exhange?", "I bought SHIB some 14 hours ago but does not show up ????", "Hey guys! \nDo you know why it's taking so much \"fee\" (or what is it) when you buy that shib coin?", "Then how may I buy shib?", "@nihalcdc \nHow can I convert xrp into shib or any other coin", "How may convert xrp into shib?", "Hey all. Yesterday I buy shib 2times, but last wrote timeout.. but my bank finish counted the money..! And crypto not have krypto. What I do", "Hey all. Yesterday I buy shib 2times, but last wrote timeout.. but my bank finish counted the money..! And crypto not have krypto", "Shib to the moon", "What's the future of shib?", "Guys could you educate me bout shib?", "To those of you that managed to buy SHIB last night but it was delayed going into your wallets  - did you also get a timed out notification?", "Shib", "Guys, People are taking profits from DOGE because it has matured and just before the show was the best moment to sell. \n\nDOGE holders are now panick selling (It has dropped a lot since the end of SNL, Elon failed, really hard), ETH and BTC are stalling, and easy money come from high volatility, expectation, and shitcoins. \n\nThe ones that are selling DOGE are coming here, my guess is DOGE is going to fall a little, still Top 10 Capitalization, but its revenues are coming here in SHIB, which is sure pumping a little, but it's all DOGE money, we are literally killing DOGE and SHIB is standing to its nickname, 0.0001 is highly possible in the next 48 hours, with the expectation of SHIBASWAP opening! \n\nTo reach 0.0001 we just need a cap of 39.5B, which is only HALF of DOGE, so this is really possible!", "Hi,  I have bought Shib from you and you have deducted money from my account but I have not received anything from you .\ncan you please check it out", "Crypto.com are you closer to fixing the technical issues?  I bought shib 3 times and dogecoin once earlier tonight the money was taken out of my account but my crypto is not showing up in my wallet yet", "@cryptocom I tried to purchase Shib and ETC it showed error message but I was charged for both. Kindly resolve the issue as it was not credited in the crypto wallet. It's been hours and no one responding from customer support.", "Same problem I had with SHIB A little earlier now waiting on support to get back to me.", "Anyone know when cro listed shib?", "Can’t see my purchase of SHIB", "Hi I also bought shib and dont find it on my account.", "Hi i've buy 2 Times shib and i dont find it on m'y account", "Just attempted to buy SHIB and then the price said “timed out” the money still came out of my checking account. And it’s not reflecting in my CRO account", "Looks like next doge killer is shib", "Hello I bought shib but got an error message however my account has been charged", "How? I sell CRO but I didn’t see shib there in the list", "How to buy shib coin", "When I’m trying to buy shib coin but transaction not going threw", "hi, i send 50usd in litecoin to crypto.com app (my first try on this platform) to buy SHIB ... but i am not able to buy it - insufficient balance .... do i need to convert ltc to another coin? or 50usd is not enought? thanks", "Excuse me \nShiba or shib", "Shib", "Me too, bought shib they took money from bank but didn’t receive anything", "In your wallet do you have shib ? If not you have to add a token. And normaly your shib will appear", "Look in the chat. Well I had no problem buying shib in cro. Caz I don’t do swap in cro anymore.", "Where are u located? I just bought shib and sold it to see if i could. I had no problem🤷‍♂️", "Well doge and shib problems are here. Wonder if cro are just cancel their payment if these coins rise. If these coins drop will cro give them the coins haha.", "Guys I bought shib in the app but i didn’t get it. I did pay the ammount though", "I trade shib in other exchange. Not in cro or binance", "Bad experiences using cro, their app crush last time. And see ppl can’t find their shib.", "Can we buy SHIB with TGBP?", "not stupid, shib is the shizzle", "Why did you guy list SHIB? Stupid decision.", "Shib ready to buy now!!!💯💯🚀", "First off I like cdc... what I dont like is when something new comes out (like SHIB) to the platform, it's all bogged down.  I am simply trying to top my card up.  This usually only takes a minute, but today it shows in the fiat wallet that I topped it, but the balance on the card still has not changed.  CMON!", "It's possible my coins is come true? Because I was  bought 4 times but only one time It's successful and other 3 times it's crypto was took my money but I didn't got coins from SHIB COINS", "Hehe couldn't resist I had to buy some Shiba. $16 got me 1.1mil SHIB 😂", "Can we transfer doge to shib on crypto", "And when it does I’m sure shib will to", "How long has SHIB been available on cryptocom", "Buy some SHIB", "Shib is a wild lottery ticket for the world! Lmaoo tats so crazy!", "Shib available on crypto.com? Lmaoo WoW I just might buy some!!", "is there an admin that can help? i bought some shiba inu and during process it timed out but it charged my card but i didnt recieve my $SHIB", "Hey. Crypto, I just bought some SHIB, the payment times out but the money has left my account and I have no SHIB?", "My SHIB COIN STILL NO HAVE IN MY WALLET", "I already deposit..i buy SHIB COIN..", "Bye 9 mil shib, have 6 mil(", "Shib avaible in Crypto.com so why ? Le collabo", "listing SHIB is really disgusting for CDC.", "just bought SHIB and it isnt showing", "Im in with SHIB", "Shib 🚀 🚀", "Shib crashing the app", "Seems crypto are scamming people tonight , I just got 150000 shib , moneys come out my bank not in app though", "brooo, wtf happened to $shib, the power of one elon musk tweet right.. 😂", "Same issue with SHIB", "Hi Admin, why can’t I see TEL and SHIB on Crypto.com app?", "I have no way to sell shib now", "Shib now tradable 😊", "I bought Shib and it's not showing up on my account !!! Not even sure it went through, very frustrating!", "I bought shib coin and it's not showing up on my account what's going on with crypto.com", "I'm trying to buy SHIB but not working I just delete the app and install again but it's not working not only this one those coin which is very cheap I can not buy it could you please helpe me", "Can I trade SHIB on app?  In USA.", "Shib has receded violently", "Believe it or not I think SHIB is now at the bottom", "Yeah I just purchased SHIB not showing up in my wallet🤔😢", "How to buy SHIB?", "SHIB, BTT, WIN", "Cryptocom App > SHIB > Buy", "Its working now lol i take back allat shib i said 😂", "Hi can you please tell me how to reset my app to buy shibs", "*missing SHIB deposit*", "Hi there,\nCould someone explain me why i can't buy any coin i want?\nFor example, i want to buy SHIB, but there is no button \"to buy\" in the app, and there is no coin on exchange (USDT/SHIB) ? Why?", "Hi, guys. Could someone explain me why i can't buy any coin i want? There is no button to buy in app?  And for example, there is no SHIB Coin on exchange, why?", "Aww c'mon man I need me some SHIB!!", "Swing with shib lol", "Omg shib damn high", "SHIB.....fyi, has gone from 286% to 481% so far during the crypto.com app crash......A lot of people aren't going to be happy", "😭😭 wanna buy shib and I can't access the app", "Hi how trade SHIB??", "Uniswap have SHIB", "I know. Is just matter of time to learn from this. Massive!!! When I saw shib listed I transfer money to the card because I knew this could happen. Im in Vegas friend. Need aone cash 🙂", "I have 21,5 Mil Shib in process but i don’t know if i really bought that because the app was tripping at that point", "I better get the shib I bought for what I paid at the time....", "I have a lot of money and all over sudden when Shib gets listed crypto.com locks me out of my own account", "Buy shib is available for me on my app n I’m in US", "Adding shib crashed their server", "SHIB", "Seems like no shiba in Crypto.com, stop with the shib questions", "Hello, can someone tell me why I cant buy shib?", "Please @crypto team\n\nList the SHIB right now", "CLICK ON TRACK than type SHIB", "You can check SHIB status over there but can’t buy right now", "Why can’t buy SHIB", "Yea shib works now for me too", "Holy Cow CDC listed SHIB! 🤤❤️", "Invest in akita, shib, elon", "Guys invest in doge trio Akita, shib, elon", "Doge 👍 or 👎", "Ask in the Doge group, this is Crypto.com 🙂", "Big giant are in planning to sell Doge...", "Yeah sell doge.", "Sell Sell Sell\nDoge..", "Don’t buy Doge\nIt will dropped to 18p by end of next week", "Buy Doge", "10k doge are mined every minute with no cap on the amount of coins. doge will never retain value unless it's capped and they burn a ton of coin", "Doge is shit coin?", "Sure, you can trade and transfer doge through the Cryptocom app 😉👍", "Can i hold doge", "Why can't I buy doge white crypto.com coin right now?", "I tried with doge\nReally usless 😅", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "Yes that's what I did with doge but haven't received anything ?", "How come I haven't received my doge from supercharger event ?", "How Current Doge's Prices Will Go Up", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "Well I think ppl should buy all of them.. Doge.. Shiba.. Inus from alaska... Just buy them all 🤪🤪", "Says the guy who only knows about Btc, Doge and Shiba 🤣. Real projects such as Ada, Theta, Vet etc. are 'cryptoassets' and less so a traditional currency.", "Hey Admin when Doge and Shiba would be available in earn, as I am unable to access it on my app", "Crypto is pretend money that a lot of people gambling their savings will lose with. Elon won't be there to mop up your tears when you're destitute because he pumped Doge without a thought, when the people that invented it that own most of it cashed in and left everyone else broke", "There are many better coins Amiga, we all know doge is a joke coin but doesn't mean it's useless", "DOGE is up again", "Doge and Shiba is available to buy sell and trade on CDC", "Do you know if crypto is listing Doge and Shiba?", "Dear staff are you considering lowering the minimo amount for the earn section? 500 doge or 8 milion of shiba Is a little bit to high i think🤷", "Who is the owner of doge and shib coins", "Already got some bud that’s why except doge", "What is the other new shitcoin next to doge and shib", "Any suggestions for short term crypto except doge", "Why will anyone consider Doge useless 🙄🙄", "🐾 DOGE or SHIB on Earn? 🐾\nWith over 50K responses, we’re adding them both!🔥\n\nEarn up to 5️⃣% p.a. on DOGE and SHIB 💰 \n\nDetails: https://blog.crypto.com/doge-shib-on-crypto-earn/", "Oh yeah, I just wanna get it off the exchange now and in to my Cold Storage but CDC wants 50 doge coins to move it \n\nWhich is a stupid high amount", "You can get Doge", "Can doge grow", "Doge have support to elon", "Doge good day", "Have you see doge today", "I have doge", "Yes and I believe doge coin", "Last night I said doge coin will grow up in this week\nNow you can see😊", "Buy doge?", "Should I buge doge?", "Doge coin will decrease?", "Hold doge", "Guys what u think about doge?", "Could you sell doge into btc on Crypto.com?", "I going get Shiba doge , Too much doges , I want see them everywhere", "Doge <3", "Doge going up", "🤣🤣 I'm a Big DOGE enthusiast ffs", "Can't say really, cause we're not financial advisors here, but I'd say DOGE", "As much as I hate to say it.. doge is going to the moon 🙄", "does doge still trustworthy today?", "Hhe doge to 10$ this time lol wow🔥🤣", "Doge buy and sale amounts", "Wow another tweet for doge now", "Doge🤝💸", "Doge *", "Go doge", "Doge is the future BTC", "No body typing here everybody went to buy some doge now 😂🤣😂😂🤣", "Doge There is a fall", "Doge 🚀 🌙 \nElon musk tweet", "Doge Going up or down?🥺", "What about doge?", "Should I hold doge or sell?", "Doge ain’t a joke anymore", "Doge make joke of everyone 😂🤣😂😂🤣", "Doge coin is a joke coin", "I need another coin with potentials like doge coin.", "Doge vs BTC?", "Correct is this elon musk didn’t give yet any statement about doge coin ……. May elon sent him personal DM so I don’t know 🤣😂🤣😂", "Not for doge coins I also have loopring and iexec RLC they also not getting high", "Elon said Tesla can’t get payment through doge that’s the reason", "Hi\n$ doge?", "What you guys think Doge will do now ??", "Stay with the doge  bro never sell it can be marcle next year", "No future , these doge and shiba coins are for whales they pump, make money and leave you on the streets 🤦🏻‍♂️why dont u people understand", "I got doge 17800 too", "Sell doge and buy etc , doge has no future🤝listen to me buy etc drop everything😊💸💸", "I have 12000 doge", "No dont buy doge", "I’m asking about both Doge and BTC", "Doge  kya karo sale ya hold rakho", "Can anyone tell me what happened with Doge", "Good evening someone could give me an information I’m not an expert I got ETH and Doge and they are losing at which price I can sell again? Thx", "So doge coin is collapsing", "We support DOGE via native network as you can see on https://help.crypto.com/en/articles/1790975-what-should-i-know-about-cryptocurrency-deposits", "Hi \n\nCan I withdraw my Doge coin on BSC or only on ERC20 on crypto.com?", "I think it has been happend because all mem tokens sent their half of the tokens to VB \nthere is 100% fair launched meme tokens like bamboo doge", "what about doge coin?", "DOGE > SHIBA > ADA", "ADA is a meme coin, like DOGE and SHIBA", "Doge Forever", "Ada is actually doing something vrs what shib is. Doge and shib are a fad right now because of Elon shitface", "Works for me Joe with Doge and Shib so far", "future bitcoin in the doge", "If there's one coin worse utility than BTC it's Doge lol. But then again Elon is an unpredictable maniac", "The most he did was put a twitter poll asking if he SHOULD accept doge. Not that he will", "I fear the time when doge will dump. All the dumb money will run. May take the entire market with it.\nAnd we have 2017 all over again", "What you will give me if I proof you Mask‘s word about doge tesla ?", "Doge is just a joke. No utility no future.", "Doge lost over half of value in 1 day", "Wait, you just said Doge is stable? When?", "Doge is stable and bitches are not", "Doge and now SHIB. I wonder if this is the end of the shitcoin trend actually ... many people have lost an awful lot of money", "Even if Shiba had the entire market cap of DOGE it would still be worth less than 1 penny", "Why? Doge did I guess", "Shiba can't even reach $0.00163... even if it had the entire market cap of Doge", "There are newer memes that will be like doge now, I don't see any point in doge already", "Doge will only make you lose money", "What about doge", "No more doge for Elon Musk?", "I am that Coach , get the Doge", "Doge was once stagnant but it also surged", "Mask sayed he will accept doge for transaction", "whip whip whip whip that shit and I had to send that shit , straight to your bitch , Cuz with Doges I am Rich. We gonna get the billiards of Doge and fuck that bitches throats", "Unfortunately I'm all tapped out or I'd be buying the fudge outta some DOGE", "Whipping doge", "doge down", "Look look mommy it's a big fat whale, he can do a couple tricks but they all gonna fail \n\nBecause this Silbert guy who thinks he the shit, I'll brown paper bag'em and let you know when it's lit \n\nHe's a complete D-bag, No, not a bag of Doge, and if he tries this shit again I hope his accounts are all froze", "Should we hold doge too?", "I sit on SHIBA DOGE AND DEEPASS ETH", "Should we hold dogee...??", "guys wdyt about doge rn ?", "Something brewing with doge dyor, but it’s not going away", "Doge is the new BTC", "Has anyone here made a mint off Doge?", "I did a transfer from my binance.us acc to my crypto.com acc but the crypto never showed up. It says complete on binance but nothing on crypto.com. I did two transfers doge and vet. Vet showed up but doge didnt. What do i do?", "What about doge coin should buy or not?", "Guys , I have Cro in crypto.com .how come I can’t purchase doge coins using Cro ?", "Bought some Doge on the dip @INR 35-36", "🐕doge 🦊 shiba lets go meme coins . All these experts will cry they underestimate the memes", "Doge To The Moon🚀", "Anyone bought doge?", "What are you thinking about doge coin", "Doge is the way tesla will go to doge mark my words", "Sure, hi Abby!\n\nYou can buy and sell DOGE through the Cryptocom App 😉👍", "Can anybody tell me about investing in doge", "Who has doge for sell??\n Dm please", "Hey Peeps ,I do need some Doge", "Just joking. It's just a dip. Buy and tomorrow all fine again. But Elons DOGE, will rise again. I think", "Switch all You're coins to DOGE. TO THE MOON!!!! 🌕", "ASAP switch you're BTC to DOGE!", "Wow Doge", "how ahd why are so many people buying SHIBA, its the dog shit of doge", "100€ on doge", "Get out as soon as possible of shiba inu copy shit coin. Vitalik buterin is dumping it and send the rewards (you're loos) to India.\n\nElon best. Buy doge now", "doge is a joke", "Heard about Kishu, this coin will overpower the Doge and Shiba", "🚀DOGE", "DOGE TO THE MOON🚀", "Hello please can some one tell m about Doge", "Pls tell about doge coin", "Imagine, someone donated 5% shiba aka 1B to india, not even DOGE has done that before", "Lmfaooo doge is dead no coming back from this..Elon setup everyone for failure", "Doge ka", "Might give the next supercharger a miss.dont really get fuck all last time I got 3 doge for 30days worth and gave up upgrading to the ruby card.", "Doge coin good to invest or not?", "DOGE COIN??", "Get DOGE,BNB,Cake.", "Should I go for doge? What are the targets?", "Doge will cross a limit of one dollar soon I think so🙂", "Doesn't mean every coin is gonna turn out like doge", "People said the same about DOGE...", "Doge ???", "Doge coin has good future?", "Am already invest in Doge coin", "Am already invest in the doge coin", "What about SHIBA INU guys i have heard that it's the next DOGE 🚀🚀🚀🚀", "What do you think about doge", "It’s because of people like you that this chat has become trash. This page used to be great but nowadays everyone comes in here and the first thing they say is: “ when moon?, shiba, doge, donkey, monkey”. \n\nAnd with this I’m done. Hope you understand you donkey", "1.89 Doge", "I would say: Trx and doge", "Should i buy doge or wynk ?", "doge?", "Doge??", "Doge knock off coins are hot right now, shiba, akita, coshi, kishu congested the whole network", "Crypto support Just took all of my Shiba uni Coins without asking i lost 1700€ and his answer was im gonna put it on doge WTF i didn't ask that now i lost a lot of money and why i asked help Whit a Missing deposit explain", "hey guys\nwhat do you think about doge", "why would you convert BTC to doge", "Hi  admin i have Bitcoin from external wallet  that i need to exchange to Doge Coin in crypto wallet  is it possible ?", "Doge 😭", "No doge dead lol", "Doge dump or pump?", "Doge .80 soon", "Doge to a dollar any time soon? Opinions ?", "I just bought 5k on doge and 5k on shibu is that ok?", "Anyone got SHIB and what are your thoughts for the future of doge", "Finally got my doge after a long wait be patient people they will fix", "I have 25000 doge coin .. Should i hold !!", "Any news on my missing coins landing it was 144 doge purchased at £48.43 last night", "doge can buy a tesla?", "Lol now that's funny. I can't convert DOGE to CRO.", "I can do DOGE to CRO, but not CRO to DOGE.", "I can do CRO to DOGE but not the other way around.", "And CRO to DOGE?", "Why I can't convert DOGE to CRO?", "Trying to convert some DOGE to CRO but I can't? Worked OK yesterday.  Sellong DOGE  won't give me CRO on the list.", "Trying to convert some DOGE to CRO but I can't? Worked OK yesterday.  Selling DOGE  won't give me CRO on the list.", "Need some help - Why I can't sell DOGE to CRO? Worked OK yesterday?", "Hi all. Why I can't sell DOGE to CRO? Worked OK yesterday?", "doge pump elon", "Just to let everyone know, i finally got my doge coin back. Thanks for all support", "Doge upp relax XXX!!!!!!!", "Doge😩", "No now investing in doge doesn’t give you more profit", "Doge", "Doge", "Hello I purchased 144 dogecoin last night the payment was taken but the transaction timed out and I didn’t receive my doge coin is there anything that can be done to either refund me or fund my coins ?", "Doge 0.52🚀", "My withdrawal of doge has been stuck for 2 days now.. still under processing", "DOGE", "Doge Holders \n\nVOTE on MUSK TWEET💲💲", "doge can buy a tesla car?", "doge can buy a tesla?", "Doge coin is the next coin going up..anticipate it", "You can even stake doge", "Is Doge now suitable for purchase", "Doge crashed tooo", "Should hod doge ?", "Should hold doge ??!", "Hahahahaha YOU, are the inner shiba, be all the doge you can be..\n Peasants 😂🤣🤣", "I push to sell button when Doge its 0.38€ but he sell it to 0.37€", "Doge its a 0.385 but i sell max to 0.375", "When doge price is high", "Doge is really dumping 😂", "Please upgrade servers, this happened with DOGE too...", "What is it “doge killer”?", "Doge everyone same boat no one helping", "All is going down. But..... \nWuff, Wuff\nDoge Army is back.We are not fu.... Ing selling! Hodl! Buy more!", "when should i sell doge", "Sold doge and bought shiba 🤣🤣🤣", "Sell doge and buy 1 inch", "Should I sell all my doge", "Elon must said he will sell 30 Billions doge this week", "What do you think guys doge will pump?", "doge will pump?", "No one gives a damn about doge. This is crypto com", "How many of u thinking doge will gain more", "doge rebound?", "Doge😩😩", "What for? That he rise than to 18?\n\nMhhh, doge has no hard dip. This is a massiv community.\nGet on bevore we rise to the moon.", "Hi everybody \nCould you tell me about Doge\nAny advice 👀", "How doge?", "Doge as well", "⚰ DOGE 😭😭😭", "Is doge coin goes up or note?", "What about doge coin ?", "Hi there, I tried to purchase twice Doge with my Credit card. At the end of the process after authorising the purchase on my online bank account and sending the money, then on the Crypto.com app says that there was an error. I didn't receive Doge but they took my money. Have any of you had this problem? I don't know how to get my money back they should have not taken it", "Will doge fall more ?", "Hello, I need help from support, I bought DOGE on the crypto.com app and the money was taken out of my bank account but I have no gotten anything", "Allot of people have happened to me but with doge on two debited transactions", "Please give me your suggestion about doge", "SHIBA inu the DOGE killer 😜", "I have buy 300 Doge ok Crypto.com but I cant’ see in my wallet", "When doge 1$? This week or next one?", "you can buy doge in App  i haven't checked trx", "I wanna buy TRX and DOGE", "No one knows, my 1400 doge coins are also missing", "Its growing up 42 to 45 ( doge)", "Check it out doge coin", "Doge growing 20h", "Doge is dead now sad to say", "I have shiba and doge both\nBut I am asking\nWhen will doge pump ?\nAnyone knows anything about that?", "Anyone knows anything about DOGE ?", "hello what coins do i buy? I have brought doge coin and sold it back when it was high yesterday now i want to buy another coins", "Crypto withdrawal, doge", "Crypto doge", "Hey guys so should I buy doge now ?", "All exchanges r crashing to much buying pressure on shiba and doge", "Ur money is not lost shiba and doge crashing all exchanges", "Hi dogee, please see pinned message. We are working hard on solving this issue.", "Dio Doge", "@Elon\nMission paid for in doge\n1st crypto in space \nIt,s Cristal clear hint doge will reach at moon \n\nCheck the Elon musk tweet", "@Elon\nMission paid for in doge\n1st crypto in space \nIt,s Cristal clear hint doge will reach at moon \n\nCheck the Elon musk tweet", "All market became shib and doge🙄", "Shiba is the new doge", "Congratulations van*****@*****com!\n🚀 You are the Weekly Lucky Draw Winner of our DOGE Treats Extravaganza! \nYou have won USD 50,000 + an Exclusive DOGE NFT 🎁\n\nCheck out the top 9 winners here with the highest number of DOGE Points: https://blog.crypto.com/crypto-com-doge-treats-extravaganza-weekly-winners-2/", "I feel your pain I lost big on doge coin pump because of this they should compensate tbh getting your investment back isn’t enough", "Wht about doge coin ? Any new updates ?", "what about doge?", "What about Doge", "It has happened every time doge ran in the past", "Yeah right they even take precautions to not happen again. This has been happening every time doge runs and now with Shiba", "Hello, I am trying to sell DOGE coin but when I sell I cannot see the funds in USD but still in DOGE. I urgently need to sell and the tool DOES NOT WORK PROPERLY !! I have sold DOGE for USDT but the import is not shown yet. TO RECEIVE A RESPONSE TO THIS WOULD BE GREAT.", "I have converted doge in cro ut not showing", "Bretello, [10.05.21 11:00]\nHello, I am trying to sell DOGE coin but when I sell I cannot see the funds in USD but still in DOGE. I urgently need to sell and the tool DOES NOT WORK PROPERLY !! I have sold DOGE for USDT but the import is not shown yet", "once this issue is resolved i have the feeling shiba will take another boom 😂 most comments are about selling doge and buying shiba 😂😂😂", "Hello, I am trying to sell DOGE coin but when I sell I cannot see the funds in USD but still in DOGE. I urgently need to sell and the tool DOES NOT WORK PROPERLY ! IT IS UNBELIVABLE THAT THERE ALL THESE PROBLEMS ALL THE TIME !!!!!! Please kindly support", "What’s doge. Shiba 🚀", "What should I do with my doge?", "I sold doge and bought Shiba 😂", "I withdrew doge to external wallet.. since under processing after 1 hour", "Bought Doge but its not in my wallet", "I bought doge but wont appear On my account", "Anything about doge coin here ?", "Doge dump😔", "Doge start 🚀", "Zoom out of the 15 minutes chart's! I might be uneducated and poorly informed on DOGE buy I ain't no dumbass on Crypto.com token! I own lot's of hem! 😂😂", "I only find advertising always on Google. I ended up here because it seems like it's the best exchange for doge, I see crypto.com everywhere 😅", "You might want to head over to DOGE community and ask there. This is the Crypto.com Official Community for all things Crypto.com 😊", "Doge became the 3rd Cryptocurrency in the world in terms of market capitalization, can anyone using it enlighten me on it's uses?", "I already have doge but I see last month it have 20000 per cent profit", "When will doge hit $1", "Doge will never be a strong investment.\n\nNOT FINANCIAL ADVICE", "What coin is best long term investment atm besides doge?", "Doge will go to 33₹ down, then pump again to 45", "Can i invest in doge now", "I just bought some DOGE and it went straight through", "Any lead about doge?", "Will doge up to 0.7 back", "I bought 50k doge in January and Sold after two weeks 😂\nThe pain is real", "I bought 50k doge in January and Sold after two weeks 😂\nThe pain is real", "Elon really made doge coin roller coaster", "Any news regarding Doge?", "Is doge shoot up to. 60 usdt", "Anikata  You got doge?", "Doge è stato twittato da Elon adesso?", "doge can againts the rules... cause doge is the rules", "4K ppl here, curios about ETH, BTC and DOGE? ...", "doge moon", "doge to the moon 🚀😍", "SpaceX payload funded by DOGE plans to reach lunar orbit in 2022", "Breaking News:\n\nhttps://www.google.co.in/amp/s/www.cnbc.com/amp/2021/05/09/spacex-accepts-dogecoin-payment-for-doge-1-mission-to-the-moon.html", "doge pump ?", "how to earn free doge", "Add the doge token on your wallet", "Stop fomoing into DOGE ❗️", "I’ve the same problem but with Doge", "I bought Doge now , but I don't see it on my account", "Kenapa doge koin turun drastis", "Same to me bought doge and didnt get yet :/", "I have a error 😕 when I buy DOGE doesn't show up in my wallet and I get charge 😑", "Ask in the Doge groups", "Guys, any news about doges?", "https://www.newswire.ca/news-releases/spacex-to-launch-doge-1-to-the-moon--875845973.html", "Due to doge holdings banks are gettings issue", "Any DOGE SHIBA shills will be promptly deleted 🙂", "Ask in the DOGE group. This is Crypto.com 🙂", "When the doge price is going 60 please tell me", "Doge is seriously decreasing am sad", "Why is doge coin decreasing now??", "But it's a learning experience and even if Doge goes straight to hell my losses won't be something I can't easily get back😌", "Nah they made fun of doge on SNL...", "Thought last night Doge was gonna hit $1", "I bought Doge Friday right before the bust", "Doge is not fundamental coin bro, if u want to realy invest search fundamental coin", "Hey guys hello to all, today i am gonna invest to crypto, already bought DOGE today, but i am a new one in cryptoworld , maybe someone can give a good advice,", "Will doge reach up to 50", "Is there any update for bloody DOGE coin? Because I am in lose 47k today", "🤔 first time having issue here I just bought some doge and it won’t show it in my wallet though it does show the transaction, help? 🥲", "shiba slowed the market down its like lounching a baby bitcoin x doge coin", "Doge satuts", "I couldn't login...couldnt take some profits from doge...now its dipped...fuck it...bought ada and bnb....nowhere to be seen. I just dont like the unprofessionalism ....uk ppl live and eat on this...smh", "Doge and shibu dropping cause elon musk said it's a \"hustle\" during snl show", "Guys your views on doge??", "Hi! Where can i find my rewards from supercharger? I don't find my doge and zilika", "So in effect everyone who bought doge may literally have their money on the moon", "Looks like the Doge has had his day", "Elon said last night DOGE was a Hoax?", "Any guesses about doge ?", "Delighted to see doge going down to $0.01", "you think buy doge on 0.42 is good idea?", "Doge scam", "Doge is over", "Same problem I had with doge", "doge", "Can't expect anything from doge for now", "Will doge go up? Anytime", "Why doge is goin down?", "We are all here because we support Cryptocom and cro... If thousands of us are selling cro to doge or shiba we drop the price of cro... If yiu really want shiba, buy with fiat..", "Because it went parabolic and doge is overbought, overvalued and is rather is dodgy coin", "Would it be wise to sell  Doge or shall  sell it now?", "Hey guys I bought doge coin but it never processed in the app but I still got charged by my bank", "Should i sell my doge or hold it?", "Wow just woke up and cro is sinking, now that alot of traders lost money on doge it will soon be time to return home with a loss for alot...", "Dont short doge at this moment, doge pump will come, and i m dumping it (again)", "Shiba is NOT doge. Else the price would be the same", "Shiba is doge. They swapped", "Why doge loosing its position", "No! Shiba is mimicking doge. But are both mimms", "Is Shiba the same as doge?", "Maybe its because the Exchange does not believe in the project/mem. So to protect you, they may chose not to sell it on Crypto.Com. You dont find in on Binance or other similar exchamges either. You mat say how about doge. BUT LOOK WHAT HAPPENED TODAY with doge. Mom says \" i hope  my mother's day gift its not doge\"....and there goes the doge headlong down the cliff. Crypto.com can say, I told you! 🥶🥶🥶🥶 its cold inhere! 😁😁😁", "And please learn first about a coin then buy it... Doge 10 biggest adresses are worth 80% of dodge supply", "Meh, gonna start buying elsewhere and just sell here. First it was 3-8 hour long doge and xml withdraws, then I loaded few grand on mco card and didn't get it for 6 hours. Now the best thing about the app, instant withdrawal has totally backfired...", "Actually it's running pretty good but you know what I've put my all savings on doge 😀", "If your apps slow take Shiba and doge down for 6 hours...", "So I tried buying xml, not Shiba or doge. I pm'd a staff member here with zero response back. My card has an auth. Hold on it. I STILL cannot purchase other coins because now it just blanks out. All I see is a whole lot of nothing on the issues webpage dealing with bad purchasing transactions. Messaging support is useless, it's just there to be delt with in few days.... How about y'all stop purchases, wait a hour then cancel all the holds you got on thousands of people's stuff", "Doge hold or sell?", "Who also wanna hold doge?", "Hey guys, should we take out doge?", "I cant buy doge", "Doge dump😭 i hate doge", "rip doge", "Lol to all the doge fomos", "Doge sold.", "Doge will growth up after 24h", "Keep holding your doge guys", "yeah man, invest ON doge, not in", "Invest on doge coin now \nSend a message", "Sell doge it will go 35", "Doge is back at 0,46€", "Doge, don’t try, it is buggy now.", "Doge coin hold or cell ?", "No mueras , doge", "How are doge ?", "Well, binance had trouble, most of all exchanges suffer outage while traffic explodes, like during doge wars...", "Not scamming, you just don't know what you do... doge does'tn like, it never tried to be better than it is, it's just useless", "Doge", "How many u lose in doge", "Sell doge before 0", "Bye bye doge", "Yo aún con doge", "Yo vendi mis doge to shiba, antes de ayer hasta el dia d hoy he multiplicado mis ganancias", "Solo prueba por ejemplo con 1000€ en doge con un aumento de 0,10€ ganaras 200€\nCon 1000€ en shiba y un aumento de 0.10€ ganarias alrededor de 7000€", "So do you suggest ‘switching’ doge to shiba?", "Guys, People are taking profits from DOGE because it has matured and just before the show was the best moment to sell. \n\nDOGE holders are now panick selling (It has dropped a lot since the end of SNL, Elon failed, really hard), ETH and BTC are stalling, and easy money come from high volatility, expectation, and shitcoins. \n\nThe ones that are selling DOGE are coming here, my guess is DOGE is going to fall a little, still Top 10 Capitalization, but its revenues are coming here in SHIB, which is sure pumping a little, but it's all DOGE money, we are literally killing DOGE and SHIB is standing to its nickname, 0.0001 is highly possible in the next 48 hours, with the expectation of SHIBASWAP opening! \n\nTo reach 0.0001 we just need a cap of 39.5B, which is only HALF of DOGE, so this is really possible!", "does anyone has any idea about doge?", "Maybe time to buy more doge?", "Everyone with doge is running to Shiba", "Doge coin ?????\nHolddd", "I believe people just wanted to book the profit, now it’s pumping again, DOGE!", "The live is not abt doge", "Why Doge getting Down?", "Doge is to ocean", "Bought doge earlier today, took my money from my debit card and never gave me my coin -_-", "When market is fearful, be greedy.. and vice versa. - Warren Buffet. So its the best time to buy doge as it price has gone down. Doge will surely rise again very soon today or tomorrow", "When buying doge??", "With doge coin", "Sell the doge or not🥲", "Doge😔😔", "It's your money. It's not a DOGE channel", "Should I keep doge or sell it for loss?", "I learned my lesson with doge lol 😂 I pray shiba goes to .1 at some point so I can sell and put that mill in bitcoin and ether an Ada and other alts that will be long term use. Etc.", "How outside america people can watch it and what did happen in snl about doge? Tnq..", "I buy doge now.?????", "This isn’t a DOGE group", "Once it’s at .1 I’m a millionaire and will sell. So hodling shiba till 1 mill. But doge selling off once it’s in green again and I can make some profit.", "What gonna do on doge sell or what?", "Don't sell your doge.. this is silly", "Elon mentioned doge on SNL and it went down -.-", "Doge hype is over", "Why doge is decreasing", "Is keeping doge safe as its value decreases", "think that is doge hype over lool", "I just send DOGE TO the scammer and contacted support team, but they never answer", "Best time for Doge", "Your opinion buy doge?", "Should i buy doge now??", "Hi \nI buy a doge now \nWhat?", "I want to buy more doge", "doge coin🤔", "Doge is on a nosedive", "Buy doge now????", "Elon will accept doge for tesla and SpaceX merch", "Buy doge now??", "Doge buy doge said Future coin doge", "Elon: Hodl the DOGE for I am coming", "If you guys are really leaning on Elon's performance on SNL to help DOGE price, please reevaluate your crypto investments.", "Doge", "How do you Guys think about doge en snl?", "what you think about DOGE", "Buy doge now?", "Doge plenty capable of killing itself", "Looks like next doge killer is shib", "Does anyone know how to cancel a transaction on crypto.com? I just got scammed from the doge-event", "My doges still setting safe at my Binance", "Bro keep going I can see people selling doge to buy this and plus it’s way more affordable compared to doge", "Is this hold on doge or sell?", "I’ve just buy doge on the app but there arent any payment, on the card yes", "Lol who knows, the way biden is spending it might drop faster than Doge after SNL tonight 😂", "I just bought DOGE, the money has been deducted but I’ve not received the tokens. Please how do I report that?", "SHIBA sounded like a DOGE that’s why I bought it", "Well doge and shib problems are here. Wonder if cro are just cancel their payment if these coins rise. If these coins drop will cro give them the coins haha.", "Same problem with doge", "I spend 55€ but there arent any doge in the app", "I’ve just buy doge on the app but there arent any payment, on the card yes", "They charge 50 dogecoin to transfer it to your own wallet now that doge is worth more $$$ the fee should re-evaluated", "It's all based on how much you have.  If you have $5000 doge in usd value $50 is nothing.  It's the cost of doing biz ..", "Not true about the $50.  ...I have a wallet with 582cdn on doge if I sell I get 559 so $22 cdn charge", "Who charges 50 for doge", "Doge sell or hold?", "the sooner you doge holders lose all your money, the better", "if you're asking about doge in a cdc group chat, you probably shouldn't be putting your money in crypto.", "Is doge going to boom again ?", "Still cant login to my account.....its so saad...everytime doge goes up idk what happens with you guys :/", "Doge sell or Buy?", "Hey guys, snl Will pump/dump doge?", "He means doge I guess", "I agree. Doge was a flip coin for me. More money to buy xrp, ada and xlm", "Can we transfer doge to shib on crypto", "Personal opinion:  I don’t think doge will end well for most.  Good luck to you, but I’m not hopping on that train and will not regret missing it.", "Not like copypaste script doge", "Doge will pump", "iota, vet, btt, ada, xrp und doge oder shiba 😀", "How much Doge now?", "Because coonbase wasn't listed shiba nor doge,  and binance is a monster compare to crypto.com ...", "Doge to the moon", "doge crypto yes?", "Doge hold or not", "Hi, what do you think about doge?  When was Pump?)", "Hey friends, i from cold Russia, sell doge now or not?", "What's about doge coin?", "About doge coin?", "/a few hours ago I bought DOGE, my bank immediately made the transaction but the app gave me the error price expired i didnt see on my transaction the DOGE COIN???? Why", "Shiba is the new doge 😍", "Is elon musk pushing Shiba Inu  also? Like doge?", "a few hours ago I bought DOGE my bank immediately made the transaction but on the app it gave me the error price expired on the app I don't see my purchased crypto? do you know why?? Tnk😘", "My friend deposited some money into doge and got charged twice. Said it timed out so he did it again. He only got one lot of doge though", "still not working for me. Not happy, Are you going to cover the drop in doge?", "Trying to buy some bootleg doge, got kicked out can't log back in, not even secured links are working, all expired by the time they reach.. thanks now I'm missing out on a opportunity to be a millionaire 🙃", "All the spam from this stupid bot constantly flooding this stuoid channel yet we cant have a real conversation in here due to the 5minute slow down and all the stupid app issues every other week.  Cryptocom is a bigger MEME than DOGE", "Imagine it ends right after the doge event", "Can we discuss about Tarde of doge.. like what will be the best time for buy some doge?", "Rene you must only have $20 in doge hoping it moons", "I can't buy more doge as app not working", "Doge is dumping actually", "Because everyone is selling their DOGE. That’s why all exchanges are overwhelmed", "Can't log in. and doge is dropping.  not happy", "Hurry up and fix this app I need to buy doge coin ☺️", "Doge got listed cdc down, shiba listed cdc down again, kittycatty list…. Do you guys not see it?", "Should be nice if crypto.com could list high potential coins before the hype, instead of after....or ask community which coins they wanted to see listed. And during Doge Wars, keep your funds safe and have fun!", "More them one hour no any response from crypto \nAnd they delete my messages!!!\nWhy Crypto.com bot working??? Where is our money??? No showing my balance I can’t buy or sell??? \n\nBow DOGE down with no any way to sell before \nReally this is not first time I lose a loooot because Crypto.com", "Doge update?", "So this is how they are controling the buying and selling of Doge today of all days.  Unless loop of trying to get in a checking the wallet", "I need to buy SHIBA, cdc should expect this to happen with the DOGE fiasco last time", "No it's another stupid doge coin knock off, absolutely ridiculous people are wasting their money on shit coins lmao", "Crypto com, i am really dissapointed, learned nothing from DOGE crash", "Wont allow me to buy or sell wallet is showing 0 dollars .. this is fucking bullshit if doge dumps and I lose money I’m gonna be pissed", "Please visit the doge group for specific discussions. \n\nWe’re Crypto.com, an App where you can buy Shiba and Doge but we don’t discuss the cryptos themselves", "People start dumping doge and buy shiba", "WHY IS DOGE DROPPING?", "Hey ANY UPDATE ON DOGE PLEASE?", "How can doge break the app?", "I can't wait till coinbase carries doge", "Where are doge expertss. Yeah doge to 10 dolar haha", "Not doge, it's shiba", "Here we go again. Doge broke Crypto.com again", "Guys what you think about doge?", "This is a sign that when things go crazy tonight with people wanting in or out of doge, people on crypto.com will not be able to do anything", "im trynna buy doge", "The time has arrived to say goodbye to CRO. I have made profit from the DOGE I received from the Supercharger event than the CRO I have been hodling since Aug 2020. Cheers!", "Attention all Holders of Doge! \n\nDon’t forget to setup your stop loss and be aware of the loss what u can make tonight! I have set mine and do so every 0.07 cent to gain en not to lose! My plan is to step out during the interview ... because there is a great chance that doge will fall back to less then .30! I will replace my investment during the fall en wil hold xrp. \n\nIt’s only advise do with it what ever you want.", "The money of doge will go back to btc", "Which coin should buy except doge", "I think England banks are investing in doge😂", "Guys what do I have to do to enter the 100.000 usd competition? Do I have to complete any survey or just buying doge", "Bring the ETH in crypto.com and then buy doge with eth", "I have eth. I need doge   \nWhat will I do\nI’m using trust wallet", "No you can't however you can swap busd to doge in trust wallet", "I want to ask can I swap eth for doge in trust wallet?", "Should I sell doge", "You need to buy or sell 100 USD worth of Doge in one go, you can transfer it to the exchange after that :)", "Hello, can someone explan:\n\nIn the DOGE Treats Extravaganza - USD 500,000 in DOGE Prizes!\n\nIf I have 50k doge in the crypto.com exchange  and buy via app the 100usd and also transfer them to crypto.com exchange.\n\nDo I participate and it will be counted correctly\n\nOr must the deposit and all happened in the app?", "What will doge all time high be in this month ??", "Doge hi Doge hone vali hai", "Doge coin countinues rising. What about this", "Hi, my mobile app has a different amount on supercharger than the desktop exchange app. I sold the DOGE, and bought some CRO. How can i sync them ? I want to see a single amount on the supercharger. How can i do it ?", "Doge Coin will run through our venes (in the future)", "Doge Ka kya rakhe", "I’m holing a lot of doge so as you know today is a critical day and I don’t know how it’s a coincidence this happened all of a sudden", "Yeah 🔥. Are you holding doge?", "Guys doge has reached .71 usd", "When will Doge reach 85$?", "Trade Dogecoin in the Crypto.com App and enter to win a share of USD $100,000 in DOGE\n\n🏆10 winners selected weekly\n🗓two weeks left\n\n🐾We’re also giving away 5 editions of Morysetta’s Doge NFT\n\nDetails: https://blog.crypto.com/doge-treats-extravaganza-usd-500-000-in-doge-prizes/", "What about doge??", "SEC? On sushiswap. Or you talking about doge?", "doge $10?", "What do you think guys? Upto which price doge will go?", "Except doge", "DOGE FLEW UPP", "I have some doge but it’s just because my sister sent me some as a joke", "I feel like DOGE will go for a long time, it's here to stay.", "IM Holding DOGE", "Greeting to all! Anyone knows about the highest price predictions of DOGE coin, and what price range we should order to sell it?", "its basically a crypto that looks and sounds better than Doge but also people that missed the dogecoin train are jumping it", "Oh.  I don’t usually buy meme coins but I’ve been thinking about it because the doge thing is so trendy.  So what is the story behind Dogelon Mars ?", "From the doge", "Don’t buy yet until Saturday because investors keep on Switching from doge to etc classic then etc classic to doge", "Doge to the moooonn", "Don't buy the one person who has 26,000,000,000 worth of it is gonna kill that market after it brakes 1$ buy fly idk if it's on here yet but it's 2 months old and 1/3 it's value Franklin aka fly  to fly to a Benjamin Franklin with doge coins money", "Hi Crypto team, I want to move my doge coin to external wallet which is trust wallet. I want to move 100 doge coins but you are charging me a fee of 50 doge coin. Why fee is so high? It doesn't make any sense", "Any updates about doge ?", "Well you give me hope........\n\nIt does suck if doge dumps tomorrow and I can’t get off the pump", "So someone really believes TA works with Doge. Made my day.", "Traders have coin the word DOGE morning", "Should i invest in doge now? I don't have any in the wallet", "Interest is just coming out of nowhere.....it's unfair.\nWell.......the world is about making money......right. And well..... everyone agree about having interest.\nSo does Doge.......😂😂😂", "These days, all groups are for Doge 🧚‍♂", "Group created for doge?", "That doge pump is just ridiculous", "Cro has more legitimacy and backing than doge", "Who thinks doge gonna increase", "Copet pd TP, doge malah makin terbang wkwkwk. Jebolin 10.500 biar lebaran di mars", "Also twice tonight I hit sell on doge and it was sold at .04 below when I hit the button.  Meanwhile other exchanges have automatic take profits to prevent that. I am once again left very very frustrated with this app/exchange and at this point I think i won’t be staying much longer.  ￼", "Have 500 doge 0'40", "Hola is posible doge Up this Week?", "There‘s 130 Billion Doge, hundreds of Million new Doge daily and no limited supply 😂😂😂", "A lot of them will crash, some people made big money but a lot of people will lose a lot. I'm thinking of Doge", "Prediction of doge rise percentage?", "Buy doge", "It’s the doge day. SNL", "Will Doge Will Go Down Again?", "He didn’t message me first!!!! I messaged in the chat asking for help. Then he messaged me. Claiming to be a administrator, it took me a while to trust him or her. Because you can’t get through you support I had a major issue last night when I bought doge coin and transferred it. It didn’t transfer all of it. And there is no support.", "I can’t even sell my doge", "Doge on", "is doge worth the hype", "How about buying doge at this time??", "Please tell if this is the right time to buy doge?", "Ask in the DOGE group, not here @elyas", "You can buy Holy Doge in crypto.com app", "Hello to all I want to buy DOGECOIN is there any toturial to teach how to buy doge", "Doge😍", "i think doge must TP before 1 dollar", "Doge to big to crash", "doge coin", "Doge", "Doge hodl 💪", "SNL hari ini semoga Doge 100k", "Wow Doge gaskeun wkwkwk", "Will doge go up", "Do u think I should buy doge?", "Kuy doge 10K malam ini", "Doge target", "Should  i invest in doge", "elon's tweet make fire in doge\nan hour ago", "Doge dump", "Any updates on doge?", "Any updates on doge?", "Any updates on doge?", "Hello guys can someone explain why will doge explode if elon says it on tv? like what what does that have to do with everything", "Anyone know about doge ?", "Is gonna hot doge 1$", "Doge coin in this moment it's a good idea to buy?", "Which is the best app and user friendly app to buy doge coin", "I have 3 bit coin but I wanted to withdrawal nd I have 23000 doge coin", "Yes doge. After 5000% + already made from last year December 2020 ..  When people will start to buy before 20-40x growth", "How many doge can one buy?", "So what is DOGE on the exchange?", "Hi. Quick question. Is doge on the exchange a bep20 coin? If not, how do you convert it into a bep20 coin?", "Hi. Quick question. Is doge on the exchange a bep20 coin? If not, how do you convert it into a bep20 coin?", "How do you convert doge to bsc doge?", "Hi. Quick question. Is doge on the exchange a bep20 coin? If not, how do you convert it into a bep20 coin?", "Doge?", "At which you bout doge", "Doge sell?", "Hi there, yes. You can buy DOGE on the Crypto.com App 😊\n\nFor the full list of supported tokens on the Crypto.com App, please check out this article: https://help.crypto.com/en/articles/1342333-which-crypto-can-i-buy-in-the-crypto-com-app", "Can I buy doge coin pls", "Do you have doge", "Hey anyone know how much doge coin will grow??", "Bro m talking about doge", "I had purched doge for .61 still holding", "What about doge?", "I already told you everyone \nDoge hit 50 check", "Doge 50", "Doge wont go up mutch more elon Musk told uss Months what he tould about crypto hes companie  is going broke ass you can see in the tesla shares he knows when u buys a coin and mention the coin People will pump it up he made a shit load of money he wil pull back the fload and you all wil lose money", "Yes marketcap is good of doge \nBut then also it not good gor holding", "Binance etheriam xrp tron these are strong base coins broh \nDoge is not a strong", "https://m.youtube.com/watch?v=u_U_dOOI9us \nElon musk tweeted about doge on tweeter \nHave post the link", "I love doge men", "Doge", "At what price should i but doge cion", "doge hold?", "doge hold?", "any  advice  which crypto should i buy now?other then doge?", "Anyone willing to sell their doge coins now?", "What do u guys think abiut doge ?", "Can we send doge coin to someone's wallet in wazirx", "What are the chances for doge to increase on 8th SNL?", "Latests on doge", "Doesn't something like two individual wallets hold around 50% of doge pool?", "Doge has lost over -10%", "So many non investor type people are buying doge right now in the US.  They are getting on board with idea of Crypto, and if they knew about the visa program with cashback, and defi staking, along with the low price per coin currently I feel they would flock right over.  Many of the same people who are buying doge would get on board with CDC if they were exposed to it.  NFL. 🏈🏈🏈", "Doge will dump trust me", "My best guess would be you haven been charged 50 Doge as per the fees table in our App. Hit Settings ⚙️, then scroll down to „Fees & Limits“.", "Why was I charged $30.00!to transfer doge to my nano s?", "Just to have 1000 so when doge hit dollar", "should i buy doge ?", "* Breaking *\nDoge might go up or down or even move sidewards.\nAs per our rules we don’t discuss prices nor do we give any advice. 😉", "What's gona happen to doge any prediction", "dont sell doge", "* Breaking *\nDoge might go up or down or even move sidewards.\nAs per our rules we don’t discuss prices nor do we give any advice. 😉", "Please tell about doge", "Io ho comprato un po' di doge e ho l app da un po' di tempo", "What about doge ?", "Guys, this is my first time here. What are your predictions about doge coin 🐶?", "Please ask in the DOGE groups, not here", "DOGE IS TRASH", "Plz stop barking about doge", "Doge has been disappointing today", "You guys are crazyy\nYou took 50 doge fees from a withdrawl of 100$ \nIs it normal??", "Doge news is fake or real??", "Suggest me doge coin is better this tyM", "will doge raise .??", "doge is falling", "I've shorted doge", "Doge will go up because people are going to buy more doge in dip", "Can I not discuss doge is it against guidelines?", "Ok is DOGE about to fall?", "Yeah he ll speak about doge coin", "So wasnt aware abt doge", "May i hav any update for doge coin...!", "Any One have idea for DOGE coins hold or sell?", "Any prediction on DOGE??", "This is a group about Crypto.com, not DOGE", "What about doge i had buyed at 55😭😭", "should i buy doge now?", "Guys invest in doge trio Akita, shib, elon", "Was listen to a channel and they were say doge need to watch out there are 3 main doge holders if just one sells their stake doge will shit it's self be back down to cents", "Farman doge up jayega kya", "I had money invested in doge and today its in tether but i had no orders set. Please help. No dm’s please", "Is it ok if I buy doge this time?", "Is time doge coin buy krna shi hoga kya", "HOLDING DOGE OR NOT", "Will doge coin keep going down or it will rise", "Buy doge now or wait?", "Doge hold or sell", "If doge listed next days on coinbase, boom. Coinbase effect +30%. Think about it", "Any idea when will doge rise?", "i dont have any doge leh", "What do you think about doge", "Doge prediction", "Doge 🐕🐕🐕🐕", "Lol I'll even take doge coin", "Will doge reach 10$", "Doge ko 8th may seh zyaada mat rakhna", "When do u think doge will reach 1$", "Doge prediction guys", "Only doge coin", "Dont buy doge anymore", "Guys should i buy doge coin today?", "If you invested $1,000 into $DOGE January 1st, it would now be worth over $220k.\n\nMind blowing.", "Wazirx..its not scam its due to server load of doge", "Is doge coin dumping?", "is it good to buy doge coin?", "doge up?", "I bought £20 doge few months ago completely forgot logged in today shot up to £200 😂", "Doge up or not", "Any doge promocodes?", "Sold the doge", "Doge is down", "Hi, you can trade DOGE with up to 50x leverage on the Crypto.com Exchange 👍", "Beware of Doge", "What is expected price for doge by end of this week", "Did you sell your DOGE for fiat on the App or on the Exchange?", "Is it good to buy doge now", "Hey can anyone tell me doge value for tomorrow", "What do u think about doge?", "Nice Doge", "There's no limit on the amount of Doge coin you can buy for now", "Doge is awesome but 9nly have 8% left now :(", "Will doge still go", "Buy doge , it is set to increase 30 percent tomorrow", "Buy xrp now sell Doge lock profit now", "Here everyone is talking about doge \nWhat the shitttt", "Doge ?", "careful about predictions I just got an infraction for shilling DOGE$$$$$", "🙅‍♂ nope not interested in doge,\nstop shilling a meme coin at people. Im sure it will go down as fast as it went up.", "Just look at doge/btc chart week/monthly, and you can see the potential rekt. Positive, all that money will drag btc nicely", "If you want to buy to make money, i think  it's not a really good idea, there is a lot of awesome blockchain projects who just ask to grow, doge is just a joke, there is no background, buy doge is just buying a part of a community.", "I think you have to take aware about doge, it is only market euphoria... Put some money on doge isn't investment for me, it's just buying a part of the doge community, the token have no bases...", "C non guys sell doge you re still in time... That's ridicoulous", "Doge coin", "Hi there, I sold some Doge. But where do they go the ones I sold? I thought were goin to my ewallet", "In coinex I can't buy doge coin \nWhy ?", "Can doge coin touch 1 dollar in week ?", "Before it was like a joke for doge owners, now everyone see like an opportunity to make money, I don’t think anyone even cared doge had a progect", "I'm out for now. Hope some people read it and are at least a bit more cautious!\nCapped coins, like bitcoin, vechain, cro, bnb and so on. They all have some sort of utility! Doge is just a joke. Master Elon said so too 😂👍", "Dogge up have 440 doge up this week 1€ boom!", "Dogee UPP!!", "Same here, still suggesting inflationary meme coins? 🤣 Take a look at total supply. Uncapped. How many new Doge are created on a daily basis... But as a trade I might agree. You never know how long stupidity will last 😂", "How much is doge now?", "OMG, how can people suggest DOGE... Come on, how long are you into crypto? Maybe it's growing for a few days or weeks, you never know. But remember my words: you will lose a shitton of money longterm.", "Absolutely centralized, a few addresses hold the majority of coins... DOGE like investing in USD or EUR. Maybe it's a good trade shortterm, but longterm... They're trying to distract people from valuable coins imo 😅", "Buy doge. It’s still on a bullish trend. But DYOR", "I bought a Doge coin for 30 cents and sold it for 65 cents. What should I buy now instead of a Doge coin?", "Buy doge and hold. It’s looking good for long term, trading companies have began exchanging for gift cards and meals. So it’s looking promising for long term holding", "Doge sucking the market", "Do you think doge will drop down?", "Doge 10$", "When is DOGE expected to crash?", "I don't want to sell Doge till Saturday. I think it will be over 1 Dolar.", "holding doge", "And probably he is going to announce something big about doge coin", "After SNL doge will go down or up????", "I had one comcern about Doge Coin", "What about Doge...?", "Will doge cross 1 usd", "Any news about doge coin", "Doge might go some 10-20% dip before roaring back on 8th FNL", "Wil doge fall", "Do you think it still worth it to buy doge now?", "Doge good day", "Doge coin to the moon", "Doge very soon $ 1.🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "Doge 🚀🚀🚀🚀🚀🚀", "Buy doge.", "You a doge guy  I can’t trust you", "Doge next market cap", "I hate Doge! Stealer of market parts", "doge btt dent", "How DOGE points work ?", "Doge is coming up again", "System, network, hatwork , backwork..DOGE IN 4", "I withdraw my doge to fiat was accepted and still not showing in my account", "I withdraw my doge to fiat was accepted and still not showing in my account", "Doge is the highest rise. What's the worst coin?", "Why can't we rally on doge coin?", "I dont have doge", "If you go all in Doge, then yes", "Doge 👍", "CRO is the best coin after Doge", "You can't trust doge it's risky", "Yo Doge Fan!!!!!", "Doge is breaking ground", "Doge and BNB", "Hi there! My ex-husband was trying to pay me with doge, which I’m thrilled about. But crypto.com charged him 50 doge and he only sent 100 (as a test) how can he see what the fees are? Will they charge half for every transfer? TIA", "Invest in a coin with fundamentals. DOGE doesn't have fundamentals but is a meme coin. It is purely random if DOGE will go up further. It might, it might not. (I hope I am not warned for this statement, as it is purely made of facts and doesn't give any opinions / financial advice apart from investing in a coin with fundamentals)", "Go doge", "I am a lucky man....i bought doge 7 days ago...😵😵", "Just double my profit on doge", "Doge is a bubble", "Is it worth investing in doge now?", "👏🤝 Road to 1 dollar.... If doge can arrive there i don't see why CRO shouldn t", "Elon and doge", "No, doge instead", "Doge Ka future target kya hai", "What about doge coin it's 40% plus", "What about doge coin?", "Yes I want doge coin", "your app is so slow when it comes to doge moonrise", "Sigh. This happened last time Doge spiked too. Today all morning I couldn’t get good price readings, spinning wheel as I refreshed. Ended up down a significant percentage of this morning’s  gains because of it.  \n\nI will freely admit that I’m relatively new to the market and don’t have a ton of money in there, but I will also say as i scale up, Repeated events like this very much damage my confidence in the app, and I’m likely to move my holdings to a different exchange.  \n\nThere’s no room for this kind of event over and over when the market gets busy. It’s one thing when my loss is 500 bucks and another when I go in enough that it could be 5000.  I really like the interface but I have to give you the feedback that right now I would be scared to upgrade my card and invest a large amount based on technical failures when the market gets busy", "Doge", "Sell doge at .5?", "Do you think doge. Will go up anymore", "This coin is insane, isn't it? 😄 I have noticed this trend as well, and the tech team is improving the overall system so things do not get traffic-jammed whenever doge/btc moons", "It's obvious it's to do with dogecoin, it did this 2 or 3 weeks ago when doge went parabolic, and now its doin it again", "It took some effort, but i managed to sell some doge in app...", "Okay mod. Well, if we can get Crypto.com up before doge hits $1 that would be wonderful.", "Doge is .61 about to hit .62", "Doge is flying", "Doge will pump until the 8th, then pump even more after Elon shills it on SNL", "Doge😍", "Go doge  go", "it's so you can hodl the doge", "This happened the last time doge was going parabolic!", "Is this a right time to sell doge coin or still hold?", "I used to buy doge.\nThen i took an Arrow to the knee....", "Should i still hold doge?", "Covert USD Into doge 😂😂", "Ltc and doge)))", "5k Doge is holding YOU!!!!\n😂😂😂😂😂😂😂😂😂", "I m Holding 5k doge 😛", "Doge 🚀", "What about doge coin now ?", "I just check my app and I don't have any problem buy and selling doge atm", "Why tf every time doge fly up, the app goes crash...", "Hey guys, what you think how much high doge can go till 8th may 😅", "https://crypto.com/exchange/trade/spot/DOGE_BTC", "Is doge coin is worth?", "$ETH $DOGE $BNB leading the market making new all time highs", "Doge coin incoming deposit is like 30 confirmations and still nothing in my account with the fuck", "DOGE?", "Doge to the moon", "How to earn doge?", "Your did not receive your DOGE from the Supercharger ?", "Where is my allocation of Doge after supercharger event??? Or is this a scam by Crypto.com", "Cause that what happened with e-toro people kept on complaining that they should add doge and they did : )", "Will doge come down???", "Where can I buy doge coin", "DOGE coin is up by +16.39%🚀🚀🚀", "Noob token, Doge is future", "doge to the moon 🌝🌝", "Congratulations rue*****@*****com!\n🚀 You are the Weekly Lucky Draw Winner of our DOGE Treats Extravaganza! \nYou have won USD 50,000 + an Exclusive DOGE NFT 🎁\n\nCheck out the top 9 winners here with the highest number of DOGE Points: https://blog.crypto.com/doge-treats-extravaganza-weekly-winners/", "Ew, doge", "DOGE💨💨", "Why I can’t convert my doge to TRON ?", "I try to convert my doge coin in to bitcoin !", "Why I can convert my doge to unader coin ?", "Why I can’t convert my doge just in CRO and not in etherium or bitcoin ?", "Hey why I can convert my doge to unader coin ? I can contvert just in CRO ?", "Doge will also be last man let out the light. Cus it has nothing to back fundamentals", "Any specific reason why doge is pumping?", "Can you please enter Supercharger in the App, choose „View Past Events“ and then „Doge“?", "You are talking about the past Supercharger (Doge) and are sure you accepted your Doge allocation in the App?\nDid you login to the Exchange as an existing App user?", "If you participated in the Doge Supercharger and accepted your rewards/allocation your Doge will show in the spot wallet on the Exchange.", "Does anyone know why my supercharge rewards aren't being shown? I entered the doge supercharge event and it's ended now but I don't see my rewards in any wallet", "Do someone know about doge future this week", "Anything about doge", "That’s announcing the winner of the weekly draw, nothing sus about it.\n\nhttps://blog.crypto.com/doge-treats-extravaganza-usd-500-000-in-doge-prizes/", "When doge was around 1 cent the transfer fee was 50 doge, now it is half a dollar and the transfer fees are still 50 doge", "Congratulations rue*****@*****com!\n🚀 You are the Weekly Lucky Draw Winner of our DOGE Treats Extravaganza! \nYou have won USD 50,000 + an Exclusive DOGE NFT 🎁\n\nCheck out the top 9 winners here with the highest number of DOGE Points: https://blog.crypto.com/doge-treats-extravaganza-weekly-winners/", "Why is the transfer fees of doge are high?", "That I did for the doge accepted but got nothing", "50 doge fee? Lol", "Plz doge up or down now", "will doge coins return ATH?", "Doge🔥🔥🔥🔥", "That’s bet, if you’re in a haste to accumulate much profit then you’ve to look for coins with strong momentum like doge ,or you could probably engage in bitcoin mining,anyone", "Doge coin is good day", "Lol I'm here to find coins definitely not shill doge 😅", "Will doge hit 1$?", "HOW ABOUT DOGE???", "I seen my mate buy 1k worth of arrr and turn it Into 49k 🤯 another guy bought doge made similar gains off that.. mine just pretty much stays the same lol", "Ofc doge", "What about Doge coin", "What about doge coin", "Be patient, Doge will go to $ 1.", "Shoud i sell? Doge?", "Doge to the moon", "Shall I buy doge now?", "I agree, but doge coin has an army. CRO is building a mafia😎", "Doge coin has an army, but they’re no match for the mafia CRO is building😃😎", "If DOGE is more worth than CRO for now, who knows what CRO will do in the future", "Doge coin", "I'm regretting now why I sold my doge", "Someone asked for doge coin growth", "Can i buy a doge", "It’s elon musk tweet on doge coin", "Please reduce transfer fees of doge", "Buy doge", "Doge", "Supercharger Doge coins still not released???? How can i trust to supercharge now??", "Didnt get my doge rewards why?", "Has someone Supercharger on Crypto com done? The doge has already been paid because I still have funds from this charger blocked and I have not received a single dog so far.", "Have you checked your exchange account for the issued doge, if so you will have to contact support", "Anyone think doge will take anymore major dips before Saturday night Live?", "I staked CRO for Doge coin and was allocated 15.5 coins. I accepted but not dispersed. Why ?", "Thoughts on Doge Coin", "What did yall say about doge?", "Doge is gonna rise", "Doge 🐶 😂😅", "Doge is dompig 😞😞😞", "Doge to the moon", "Who else going to mars With doge😁", "Doge target 🎯", "Anyway, is doge a good crypto for long term investment?", "Doge", "Sell target of doge", "Doge is going craY", "I've sent myself some doge and my binance wallet shows it successful however not recieved anything in my crypto.com wallet?", "Hi admin,  i tried to buy doge coin but it said transaction failed even after deducting said amout from my account", "People will be moving from doge to Elon for sure", "Well, it’s just listed. Low market cap. Elon has a good name and is a fork off DOGE", "$ELON coin, what do you guys think? Fork off DOGE.", "İ bought aion and doge"]